# 1)написати прогу яка вибирає зі введеної строки цифри і виводить їх через кому,
# наприклад:

st = 'as 23 fdfdg544'

st1 = []
k = [st1.append(i) if i.isdigit() else print() for i in st]
print(st1)

#################################################################################
# 2)написати прогу яка вибирає зі введеної строки числа і виводить їх
# так як вони написані
# наприклад:
st2 = 'as 23 fdfdg544 34'  # введена строка
# 23, 544, 34  # вивело в консолі
#################################################################################
# 3)прога, що виводить кількість кожного символа з введеної строки, наприклад:
st3 = 'as 23 fdfdg544'
st1 = []
st = []
for i in st3:
    k = i + '->' + str(st3.count(i))
    st.append(k)
    st1 = list(set(st))
print(st1)

for s in st1:
    print(s)

# 2 часть(list comprehension):

# 1)есть строка:
greeting = 'Hello, world'
# записать каждый символ в лист поменяв его на верхний регистр
# пример:
# ['H', 'E', 'L', 'L', 'O', ',', ' ', 'W', 'O', 'R', 'L', 'D']
st1 = []
k = [st1.append(i.upper()) for i in greeting]
print(st1)

# 2) с диапазона от 0-50 записать в лист только не парные числа, при этом возвести их в квадрат
# пример:
# [0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, ...]
l1 = [i for i in range(50)]
print(l1)
k1 = []
k = [k1.append(i * i) if i % 2 != 0 else print() for i in l1]
print(k1)

# 3)  есть лист:
numbers = [1, 2, 3, 4, 5, 6, 7, 8]
# создать новый лист и записать в него 'GT' если элемент в numbers больше 4 и 'LT' если элемент меньше или равен  4
# пример:
# ['LT', 'LT', 'LT', 'LT', 'GT', 'GT', 'GT', 'GT']
l1 = ['LT' if i <= 4 else 'GT' for i in numbers]
print(l1)

# 4) есть два листа:

list1 = [1, 2, 3, 4, 5]
list2 = [-1, 7, 10, -5, -2]
k1 = []
g1 = []

# записать в лист тюплы(x, y) если x + y == 0 пример: [(1, -1), (2, -2), (5, -5)]
for i in list1:
    for j in list2:
        if i + j == 0:
            g = [g1.append(i)]
            g = [g1.append(j)]
            k= [k1.append(tuple([i,j]))]

print(k1)
